In [1]:
# Filter
import numpy as np
import pandas as pd

In [2]:
a1 = [60, 84, 80, 70,'문예부']
a2 = [77, 62, 95, 85,'과학부']
a3 = [61, 97, 72, np.nan,'농구부']
a4 = [75, 65, 95, np.nan,'다도부']
cols = ['국어', '영어', '수학', '과학', '소속']
b1 = ['문예부', '과학부', '다도부']
df = pd.DataFrame([a1, a2, a3, a4], index=list('ABCD'), columns=cols)
df

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
C  61  97  72   NaN  농구부
D  75  65  95   NaN  다도부

In [3]:
df["국어"]

A    60
B    77
C    61
D    75
Name: 국어, dtype: int64

In [4]:
df["국어"] > 70

A    False
B     True
C    False
D     True
Name: 국어, dtype: bool

In [5]:
df.loc[df["국어"] > 70]

   국어  영어  수학    과학   소속
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [6]:
cond1 = df["국어"] > 70
df.loc[cond1, "국어":"과학"]

   국어  영어  수학    과학
B  77  62  95  85.0
D  75  65  95   NaN

In [7]:
df1 = pd.DataFrame(np.arange(12).reshape(-1, 3), columns=['A', 'B', 'C'])
# reshape(-1, 2)는 단순히 2열 matrix를 만든다는 의미 -여기서 -1은 5와 같은 index
df1

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [14]:
df1.where(df1 % 3 == 0, -df1)

   A   B   C
0  0  -1  -2
1  3  -4  -5
2  6  -7  -8
3  9 -10 -11

In [8]:
# Series or DataFrame을 조건식으로 True/False로 만들어 True값을 갖는 Data만 추출한다.

In [9]:
df

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
C  61  97  72   NaN  농구부
D  75  65  95   NaN  다도부

In [10]:
cond1 = df['국어'] > 60
cond2 = df['수학'] > 75
# conditional은 Boolean값을 생성한다 대상이 Series면 Boolean Series, 
df.loc[cond1 & cond2]

   국어  영어  수학    과학   소속
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [11]:
df.loc[df['과학'].isnull()]

   국어  영어  수학  과학   소속
C  61  97  72 NaN  농구부
D  75  65  95 NaN  다도부

In [12]:
df.loc[(~df['과학'].isnull()) & (df['수학'] > 90)]
# & , |는 괄호를 사용하여 구분하여 주어야 한다.     🔰

   국어  영어  수학    과학   소속
B  77  62  95  85.0  과학부

In [13]:
df.loc[df['소속'].isin(['문예부', '다도부'])]

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
D  75  65  95   NaN  다도부